[
    {
        "id": "sectionBox_unfdq5xspd",
        "contentIndex": 0,
        "title": "Understanding Sets",
        "text": "<p>In any field of mathematics, it is important to be able to deal with <i>objects</i> and <i>structures</i>. At the lowest level of mathematical objects and structures are sets. Most simply, a set is a collection of objects. We can think of the set of all flowers in Hawaii, or the set of whole numbers between 10 and 37. Typically, we use curly brackets (or braces) to denote a set, such as \\(\\{1,2,3\\}\\). If we are using the same set many times in a row, or talking about a set that cannot easily be written down, we can use some other symbol. Throughout this tutorial, we will let \\(S\\) be the set \\(\\{1,2,3\\}\\), and \\(H\\) be the set of all flowers in Hawaii.</p>\n<p> There are certain rules and terms used with sets that allow mathematicians to be consistent when using and talking about sets. For example, we want to know what to call the objects in our sets in general, and how we can write sets.</p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\n    Element: Each object or member of a set is called an <i>element</i> of the set. Each element can only occur once in a set. \\(\\{1,2,1,3\\}\\) is not a valid set since \\(1\\) occurs twice. In addition, the order of elements in a set does not matter. \\(S = \\{1,2,3\\} = \\{3,1,2\\}\\).\n  </div>\n</div>\n<p> It is also natural to wish to talk about the number of elements in a set.</p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\nCardinality: The number of elements in a set is called the <i>cardinality</i> of the set. The cardinality is often denoted with bars around the set. Since \\(S\\) has three elements, we can write \\(|S| = 3\\).\n  </div>\n</div>\n<p>For this tutorial, we will only be looking at sets with <i>finite</i> cardinality, so we can list and count every element in the set. Future tutorials will consider larger sets, which will be even more powerful.</p>\n<p> Often we want to look at some of the elements in a set, but not all of them. For example, we might want the elements of \\(H\\) which are red flowers. This gives rise to the idea of a subset.</p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\nSubset: If a every element in some set \\(A\\) is also in a set \\(B\\), we say that \\(A\\) is a <i>subset</i> of \\(B\\), and write \\(A\\subset B\\). For example, the set \\(\\{1,3\\}\\) is a subset of \\(S\\).\n  </div>\n</div>\n<p> There is one set that is used very often in mathematics, so it is good to introduce it here. What happens when your set has no elements?</p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\n       Empty Set: The <i>empty set</i> is defined to be the set which has no elements. The most common notation is \\(\\emptyset\\), but sometimes you may see \\(\\{\\}\\), which emphasizes it is a set with no elements.\n  </div>\n</div>\n<p> Almost everything you see and do in mathematics has sets hiding in the background. They are a universal way of communicating mathematical ideas, and are thus very important to understand.",
        "charts": []
    },
    {
        "id": "sectionBox_rqanf5bit6",
        "contentIndex": 1,
        "title": "Understanding Functions",
        "text": "<p>Now that we have sets, we want to start to create, define, and communicate relationships and patterns <i>between</i> sets. Mathematics uses the language of a function to describe these relationships.<p>\n<p>A function is a rule that takes elements of one set (often called <i>inputs</i>) and assigns them to elements of another set (often called <i>outputs</i>.) The first rule to always remember is that a function only has a single output for each input. </p>\n<p> Let's first look at a simple example of a function, where we take elements in our set \\(S = \\{1,2,3\\}\\) from before, and assign them to another set \\(F = \\{\\text{apples}, \\text{bananas}, \\text{strawberries}\\}\\) according to the following table:\n$$\n\\begin{aligned}\n1 & \\to & \\text{bananas}\\\\\n2& \\to & \\text{strawberries}\\\\\n3 & \\to & \\text{apples}\n\\end{aligned}\n$$\n</p>\n<p>There are many notations used to discuss functions. This tutorial will use \\(f: A\\to B\\), while future tutorials may introduce more. We call \\(f\\) the function, where it takes elements from the set \\(A\\) and assigns them to elements in the set \\(B\\). It is good to have a common language to describe what the sets \\(A\\) and \\(B\\) are.\n</p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\n    Domain: If we have a function \\(f: A\\to B\\), we call the set \\(A\\) the <i>domain</i> of the function \\(f\\). It can be thought of the collection of possible inputs to the function. \n  </div>\n</div>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\n    Codomain: If we have a function \\(f:A\\to B\\), we call the set \\(B\\) the <i>codomain</i> of the function \\(f\\). The codomain is a set that contains all possible outputs, but may have extra elements as we will see soon. \n  </div>\n</div>\n<p>Let's look at the function from before. If we call this function \\(g\\), we can denote it as \\(g: S\\to F\\), since we took inputs from \\(S\\) and assigned them to outputs in the set \\(F\\).  </p>\n<p> Imagine you wanted to easily write down that our function \\(g\\) took the input \\(2\\) and assigned it to \\(\\text{strawberries}\\), but did not want to copy down the entire table. This is very common in mathematics, so we have a useful notation. We will write \\(g(2) = \\text{strawberries}\\). This is most commonly read as \\(``g\\text{ of }2\\text{ equals strawberries.}\"\\) This notation is very flexible, as it allows us to have more than one element as the input. For example, since the subset \\(\\{1,3\\} \\subset S\\) has elements assigned to \\(\\{\\text{bananas},\\text{apples}\\}\\subset F\\), we can say\n$$f(\\{1,3\\}) = \\{\\text{bananas},\\text{apples}\\}$$\n</p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\n    Function Notation: If we have a function \\(f:A\\to B\\), and \\(a\\) is some element of \\(A\\) which the function assigns to some element \\(b\\) in \\(B\\), then we write \\(f(a) = b\\), pronounced \"\\(f\\) of \\(a\\) is equal to \\(b\\).\"  Similarly, if \\(A^\\ast \\subset A\\) is some subset of \\(A\\) such that the elements of \\(A^\\ast\\) are assigned exactly to elements in some \\(B^\\ast \\subset B\\), we write \\(f(A^\\ast) = B^\\ast \\).\n  </div>\n</div>\n<p>We may wonder what \\(f(A)\\) is. Since \\(A\\) is the domain of \\(f\\), every element in \\(A\\) is assigned to some element in \\(B\\). So, \\(f(A)\\) must be the set of all possible outputs for the function. </p>\n<div class=\"message is-primary\" style=\"white-space:normal;\">\n  <div class=\"message-header\">Definition</div>\n  <div class=\"message-body\">\n    Range: The <i>range</i> of a function \\(f\\) (also commonly called the <i>image</i>) is defined to be the set \\(f(A)\\), or the set of all possible outputs of the function.\n  </div>\n</div>\n<p> Since all possible outputs must exist in the codomain \\(B\\), for any function \\(f:A\\to B\\) we must have \\(f(A) \\subset  B\\). For example, let's introduce another set \\(X = \\{w,x,z,y\\}\\), and we will define a new function \\(h: S\\to X\\) defined by\n$$\\begin{aligned}\nf(1) &= w\\\\\nf(2) &= y\\\\\nf(3) &= z\n\\end{aligned}$$\nThen, \\(f(S) = f(\\{1,2,3\\}) = \\{w,y,z\\} \\subset X\\). So, the range of the function does not have to be equal to the codomain.</p>\n<p> It is good to notice that a function can assign different inputs to the same output. For example, we can define a function \\(p: S\\to \\{1\\}\\) by \\(p(1) = 1, \\:p(2) = 1, \\:p(3) = 1.\\)",
        "charts": []
    }
]