[
    {
        "id": "sectionBox_unfdq5xspd",
        "contentIndex": 0,
        "title": "Sets",
        "text": "<p>Most simply, a set is a collection of objects. We can think of the set of all flowers in Hawaii, or the set of whole numbers between 10 and 37. Typically, we use curly brackets (or braces) to denote a set, such as \\(\\{1,2,3\\}\\). If we are using the same set many times in a row, or talking about a set that cannot easily be written down, we can use some other symbol. Throughout this tutorial, we will let \\(S\\) be the set \\(\\{1,2,3\\}\\), and \\(H\\) be the set of all flowers in Hawaii.</p>\n<p> There are certain rules and terms used with sets that allow mathematicians to be consistent when using and talking about sets. </p>\n<p> - Each object in a set is called an <b>element</b> of the set.\n - Each element can only occur once in a set. \\(\\{1,2,1,3\\}\\) is not a valid set since \\(1\\) occurs twice.\n - The order of elements in a set does not matter. \\(S = \\{1,2,3\\} = \\{3,1,2\\}\\).\n - The number of elements in a set is called the set's <b>cardinality</b>. This tutorial will only work with finite sets, where the cardinality is a whole number.\n - The cardinality is often denoted with bars around the set. Since \\(S\\) has three elements, we can write \\(|S|\\) = 3.\n - If a every element in some set \\(A\\) is also in a set \\(B\\), we say that \\(A\\) is a <b>subset</b> of \\(B\\), and write \\(A\\subset B\\). For example, the set \\(\\{1,3\\}\\) is a subset of \\(S\\).\n</p>\n<p> Almost everything you see and do in mathematics has sets hiding in the background. They are a universal way of communicating mathematical ideas, and are thus very important to understand.",
        "charts": []
    },
    {
        "id": "sectionBox_rqanf5bit6",
        "contentIndex": 1,
        "title": "Functions",
        "text": "<p>A function is a rule that takes elements of one set (often called <b>inputs</b>) and assigns them to elements of another set (often called <b>outputs</b>.) The first rule to always remember is that a function only has a single output for each input. </p>\n<p> Let's first look at a simple example of a function, where we take elements in our set \\(S = \\{1,2,3\\}\\) from before, and assigns them to another set \\(F = \\{\\text{apples}, \\text{bananas}, \\text{strawberries}\\}\\) according to the following table:\n$$\n\\begin{aligned}\n1 & \\to & \\text{bananas}\\\\\n2& \\to & \\text{strawberries}\\\\\n3 & \\to & \\text{apples}\n\\end{aligned}\n$$\n</p>\n<p>There are many notations to define a function. This tutorial will use \\(f: A\\to B\\). We call \\(f\\) the function, where it takes elements from the set \\(A\\) and assigns them to elements in the set \\(B\\). In this notation, \\(A\\) is called the <b>domain</b> of the function, and \\(B\\) is called the <b>codomain</b>. Let's look at the function from before. If we call this function \\(g\\), we can denote it as \\(g: S\\to F\\), since we took inputs from \\(S\\) and assigned them to outputs in the set \\(F\\).  </p>\n<p> Imagine you wanted to easily write down that our function \\(g\\) took the input \\(2\\) and assigned it to \\(\\text{strawberries}\\), but did not want to copy down the entire table. This is very common in mathematics, so we have a useful notation. We will write \\(g(2) = \\text{strawberries}\\). This is most commonly read as \\(``g\\text{ of }2\\text{ equals strawberries.}\"\\) This notation is very flexible, as it allows us to have more than one element as the input. For example, since the subset \\(\\{1,3\\} \\subset S\\) has elements assigned to \\(\\{\\text{bananas},\\text{apples}\\}\\subset F\\), we can say\n$$f(\\{1,3\\}) = \\{\\text{bananas},\\text{apples}\\}$$\nThis allows us to define what is commonly called either the <b>image</b> or <b>range</b> of \\(f\\). If \\(A\\) is the domain of \\(f:A\\to B\\), then the range of \\(f\\) is just \\(f(A)\\). In other words, it is all elements in \\(B\\) who have some input assigned to them. ",
        "charts": []
    }
]